-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: kocruit
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `company`
--

DROP TABLE IF EXISTS `company`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `company` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` text,
  `address` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL,
  `bus_num` varchar(50) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `values_text` text COMMENT '회사 인재상·핵심 가치(줄바꿈, 쉼표 구분)',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`),
  UNIQUE KEY `bus_num` (`bus_num`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `company`
--

LOCK TABLES `company` WRITE;
/*!40000 ALTER TABLE `company` DISABLE KEYS */;
INSERT INTO `company` VALUES (1,'KOSA일반회사',NULL,'충청북도 청주시 흥덕구 강서로 77',NULL,NULL,'B001','2025-07-07 00:58:23','2025-07-14 05:25:38','도전\n협업\n고객중심'),(2,'KOSA소비재',NULL,'울산광역시 남구 삼산로 17',NULL,NULL,'B002','2025-07-07 00:58:24','2025-07-14 05:25:42','품질\n트렌드감각\n지속가능'),(3,'KOSA전자',NULL,'제주특별자치도 제주시 첨단로 55',NULL,NULL,'B003','2025-07-07 00:58:24','2025-07-14 05:25:45','혁신\n정확\n신뢰'),(4,'KOSA공공',NULL,'대전광역시 유성구 대학로 99',NULL,NULL,'B004','2025-07-07 00:58:24','2025-07-19 16:32:44','공익\r\n투명\r\n공정\r\n책임\r\n혁신\r\n소통\r\n협업\r\n전문성\r\n변화\r\n보안의식\r\n'),(5,'KOSA에너지',NULL,'경기도 수원시 영통구 광교중앙로 22',NULL,NULL,'B005','2025-07-07 00:58:24','2025-07-14 05:25:58','안전\n친환경\n효율'),(6,'KOSA금융',NULL,'전라북도 전주시 덕진구 백제대로 88',NULL,NULL,'B006','2025-07-07 00:58:24','2025-07-14 05:26:01','정직\n신뢰\n고객가치'),(7,'KOSA바이오',NULL,'경기도 성남시 분당구 판교로 242',NULL,NULL,'B007','2025-07-07 00:58:25','2025-07-14 05:26:03','연구\n도전\n윤리'),(8,'KOSA건설',NULL,'대구광역시 수성구 동대구로 23',NULL,NULL,'B008','2025-07-07 00:58:25','2025-07-14 05:26:06','품질\n안전\n책임'),(9,'KOSA보안',NULL,'대구광역시 수성구 동대구로 23',NULL,NULL,'B009','2025-07-07 00:58:25','2025-07-14 05:26:19','신뢰\n보안\n책임'),(10,'KOSA물류',NULL,'전라북도 전주시 덕진구 백제대로 88',NULL,NULL,'B010','2025-07-07 00:58:25','2025-07-14 05:26:21','신속\n정확\n안정'),(11,'KOSA마케팅',NULL,'제주특별자치도 제주시 첨단로 55',NULL,NULL,'B011','2025-07-07 00:58:25','2025-07-14 05:26:24','창의\n데이터기반\n성장'),(12,'KOSA엔터',NULL,'전라북도 전주시 덕진구 백제대로 88',NULL,NULL,'B012','2025-07-07 00:58:25','2025-07-14 05:26:26','창의\n열정\n즐거움'),(13,'KOSA기계',NULL,'경기도 수원시 영통구 광교중앙로 22',NULL,NULL,'B013','2025-07-07 00:58:26','2025-07-14 05:26:29','정밀\n신뢰\n효율');
/*!40000 ALTER TABLE `company` ENABLE KEYS */;
UNLOCK TABLES;


--
-- Table structure for table `department`
--

DROP TABLE IF EXISTS `department`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `department` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` text,
  `job_function` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `company_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `company_id` (`company_id`),
  CONSTRAINT `department_ibfk_1` FOREIGN KEY (`company_id`) REFERENCES `company` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=82 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `department`
--

LOCK TABLES `department` WRITE;
/*!40000 ALTER TABLE `department` DISABLE KEYS */;
INSERT INTO `department` VALUES (1,'경영지원팀',NULL,'총무/인사 담당자 신입 채용','2025-06-23 06:24:23','2025-07-07 05:54:29',1),(2,'영업1팀',NULL,'B2B 영업 담당자 모집','2025-06-23 06:24:23','2025-07-07 05:54:29',2),(3,'구매팀',NULL,'구매/자재 담당자 채용','2025-06-23 06:24:23','2025-07-07 05:54:29',3),(4,'기획팀',NULL,'경영기획 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:29',4),(5,'고객지원팀',NULL,'고객지원(AS/CS) 담당자','2025-06-23 06:24:23','2025-07-07 05:54:29',5),(6,'상품기획팀',NULL,'상품기획(MD) 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:30',6),(7,'유통관리팀',NULL,'유통관리/물류 신입채용','2025-06-23 06:24:23','2025-07-07 05:54:30',7),(8,'디자인팀',NULL,'패키지 디자이너 모집','2025-06-23 06:24:23','2025-07-07 05:54:30',8),(9,'마케팅팀',NULL,'마케팅/브랜드매니저 채용','2025-06-23 06:24:23','2025-07-07 05:54:30',9),(10,'품질관리팀',NULL,'품질관리(QC) 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:30',10),(11,'하드웨어개발팀',NULL,'회로설계 엔지니어 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:31',11),(12,'펌웨어개발팀',NULL,'펌웨어 개발자 채용','2025-06-23 06:24:23','2025-07-07 05:54:31',12),(13,'품질관리팀',NULL,'품질관리(QA) 담당자 채용','2025-06-23 06:24:23','2025-07-07 05:54:31',13),(14,'R&D센터',NULL,'신제품 연구개발 엔지니어 채용','2025-06-23 06:24:23','2025-07-07 05:54:31',1),(15,'생산기술팀',NULL,'전자제품 생산기술 담당자 모집','2025-06-23 06:24:23','2025-07-07 05:54:31',2),(16,'공공정책기획팀',NULL,'공공정책 연구원 채용','2025-06-23 06:24:23','2025-07-07 05:54:31',3),(17,'공공IT사업팀',NULL,'공공기관 IT사업 PM/PL 모집','2025-06-23 06:24:23','2025-07-07 05:54:32',4),(18,'행정지원팀',NULL,'행정사무 담당자 모집','2025-06-23 06:24:23','2025-07-07 05:54:32',5),(19,'정보보호팀',NULL,'공공 정보보안 담당자 채용','2025-06-23 06:24:23','2025-07-07 05:54:32',6),(20,'공공데이터팀',NULL,'공공데이터 분석가 채용','2025-06-23 06:24:23','2025-07-07 05:54:32',7),(21,'신재생에너지팀',NULL,'신재생에너지 엔지니어 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:32',8),(22,'에너지사업기획팀',NULL,'에너지 사업기획/전략 담당자','2025-06-23 06:24:23','2025-07-07 05:54:33',9),(23,'전력IT팀',NULL,'전력IT 시스템 개발자 채용','2025-06-23 06:24:23','2025-07-07 05:54:33',10),(24,'설비관리팀',NULL,'발전설비 유지보수 담당자','2025-06-23 06:24:23','2025-07-07 05:54:33',11),(25,'안전관리팀',NULL,'안전관리자(에너지설비) 채용','2025-06-23 06:24:23','2025-07-07 05:54:33',12),(26,'자산관리팀',NULL,'PB(프라이빗뱅커) 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:33',13),(27,'금융IT개발팀',NULL,'금융 IT 시스템 개발자 채용','2025-06-23 06:24:23','2025-07-07 05:54:33',1),(28,'기업금융팀',NULL,'기업금융/투자심사 담당자','2025-06-23 06:24:23','2025-07-07 05:54:34',2),(29,'리스크관리팀',NULL,'리스크 분석/관리자 신입채용','2025-06-23 06:24:23','2025-07-07 05:54:34',3),(30,'고객센터',NULL,'금융고객상담사 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:34',4),(31,'연구개발팀',NULL,'바이오의약품 R&D 연구원 모집','2025-06-23 06:24:23','2025-07-07 05:54:34',5),(32,'품질보증팀',NULL,'품질보증(QA) 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:34',6),(33,'생산관리팀',NULL,'바이오 생산관리 담당자','2025-06-23 06:24:23','2025-07-07 05:54:35',7),(34,'임상개발팀',NULL,'임상시험 CRA 채용','2025-06-23 06:24:23','2025-07-07 05:54:35',8),(35,'사업개발팀',NULL,'바이오사업 기획/BD 담당자','2025-06-23 06:24:23','2025-07-07 05:54:35',9),(36,'건축설계팀',NULL,'건축설계 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:35',10),(37,'토목사업팀',NULL,'토목시공/현장관리 담당자','2025-06-23 06:24:23','2025-07-07 05:54:35',11),(38,'안전관리팀',NULL,'건설안전관리자 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:35',12),(39,'견적팀',NULL,'건설견적/원가관리 담당자','2025-06-23 06:24:23','2025-07-07 05:54:36',13),(40,'기계설비팀',NULL,'건설기계/설비 엔지니어 모집','2025-06-23 06:24:23','2025-07-07 05:54:36',1),(41,'보안관제센터',NULL,'정보보안/네트워크 관제 신입·경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:36',2),(42,'보안컨설팅본부',NULL,'보안컨설팅/모의해킹 신입·경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:36',3),(43,'IT인프라보안팀',NULL,'IT 인프라 보안 엔지니어 채용','2025-06-23 06:24:23','2025-07-07 05:54:36',4),(44,'솔루션개발팀',NULL,'보안 솔루션 SW개발자 채용','2025-06-23 06:24:23','2025-07-07 05:54:37',5),(45,'보안기획팀',NULL,'보안 정책·기획 담당자 채용','2025-06-23 06:24:23','2025-07-07 05:54:37',6),(46,'창고운영팀',NULL,'창고관리 및 입출고 담당자','2025-06-23 06:24:23','2025-07-07 05:54:37',7),(47,'물류운송팀',NULL,'운송·배송기사 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:37',8),(48,'수출입팀',NULL,'국제물류/수출입 담당자','2025-06-23 06:24:23','2025-07-07 05:54:37',9),(49,'운영기획팀',NULL,'물류운영 기획·분석 담당자','2025-06-23 06:24:23','2025-07-07 05:54:38',10),(50,'안전관리팀',NULL,'물류센터 안전관리자 채용','2025-06-23 06:24:23','2025-07-07 05:54:38',11),(51,'디지털마케팅팀',NULL,'디지털 마케팅 담당자 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:38',12),(52,'콘텐츠마케팅팀',NULL,'콘텐츠 마케터(영상/카드뉴스) 채용','2025-06-23 06:24:23','2025-07-07 05:54:38',13),(53,'브랜딩팀',NULL,'브랜드 마케팅/PR 담당자','2025-06-23 06:24:23','2025-07-07 05:54:38',1),(54,'데이터분석팀',NULL,'마케팅 데이터 분석가 채용','2025-06-23 06:24:23','2025-07-07 05:54:38',2),(55,'이벤트기획팀',NULL,'이벤트·프로모션 기획 담당자 채용','2025-06-23 06:24:23','2025-07-07 05:54:39',3),(56,'매니지먼트팀',NULL,'아티스트 매니저 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:39',4),(57,'콘텐츠기획팀',NULL,'콘텐츠 기획/운영 담당자','2025-06-23 06:24:23','2025-07-07 05:54:39',5),(58,'마케팅팀',NULL,'엔터 마케팅/프로모션 담당자','2025-06-23 06:24:23','2025-07-07 05:54:39',6),(59,'A&R팀',NULL,'A&R 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:39',7),(60,'홍보팀',NULL,'엔터테인먼트 PR 담당자 채용','2025-06-23 06:24:23','2025-07-07 05:54:40',8),(61,'기계설계팀',NULL,'기계설계 엔지니어 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:40',9),(62,'생산관리팀',NULL,'기계장비 생산관리 담당자','2025-06-23 06:24:23','2025-07-07 05:54:40',10),(63,'설비기술팀',NULL,'설비유지보수 기술자 모집','2025-06-23 06:24:23','2025-07-07 05:54:40',11),(64,'품질보증팀',NULL,'품질보증(QA) 담당자 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:40',12),(65,'연구개발팀',NULL,'기계 R&D 연구원 신입/경력 채용','2025-06-23 06:24:23','2025-07-07 05:54:40',13),(66,'토스트팀',NULL,NULL,'2025-07-10 09:09:43','2025-07-10 09:09:43',4),(67,'개발팀',NULL,NULL,'2025-07-10 09:17:32','2025-07-10 09:17:32',4),(68,'테스트부서',NULL,NULL,'2025-07-11 09:14:47','2025-07-11 09:14:47',4),(69,'귀가팀',NULL,NULL,'2025-07-11 10:02:31','2025-07-11 10:02:31',4),(70,'Test Dept',NULL,NULL,'2025-07-11 10:06:01','2025-07-11 10:06:01',4),(71,'부서1',NULL,NULL,'2025-07-12 02:00:39','2025-07-12 02:00:39',4),(72,'부서2',NULL,NULL,'2025-07-12 02:02:44','2025-07-12 02:02:44',4),(73,'삭부',NULL,NULL,'2025-07-12 07:34:20','2025-07-12 07:34:20',4),(74,'삭부2',NULL,NULL,'2025-07-12 07:36:08','2025-07-12 07:36:08',4),(75,'뭉ㄹ',NULL,NULL,'2025-07-12 07:39:24','2025-07-12 07:39:24',4),(76,'인사팀',NULL,NULL,'2025-07-12 08:47:04','2025-07-12 08:47:04',4),(77,'밥팀',NULL,NULL,'2025-07-14 06:51:38','2025-07-14 06:51:38',4),(78,'ㅓ',NULL,NULL,'2025-07-14 06:56:16','2025-07-14 06:56:16',4),(79,'ㅇ',NULL,NULL,'2025-07-14 13:07:43','2025-07-14 13:07:43',4),(80,'ㅏ',NULL,NULL,'2025-07-14 13:20:17','2025-07-14 13:20:17',4);
/*!40000 ALTER TABLE `department` ENABLE KEYS */;
UNLOCK TABLES;





